tap "FelixKratz/formulae" # for borders
tap "homebrew/bundle"
tap "k1LoW/tap"
tap "manaflow-ai/cmux"
tap "olets/tap"

brew "actionlint"
brew "aqua"
brew "atuin"
brew "bat"
brew "borders"
#brew "codex"
brew "colima"
brew "curl"
brew "difftastic"
brew "direnv"
brew "docker"
# need to create a symlink for ~/.docker/cli-plugins/docker-buildx
# to /opt/homebrew/Cellar/docker-buildx/<version>/bin/docker-buildx
# or use `docker buildx install` after installing docker-buildx
# see
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "duckdb"
brew "emacs"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "git-lfs"
brew "glow"
brew "gnu-sed"
brew "go"
brew "go-parquet-tools"
brew "gojq"
brew "hugo"
brew "jnv"
brew "jq"
brew "k1LoW/tap/mo"
brew "kubectx"
brew "libpq"
brew "marp-cli"
brew "mcap"
brew "mise"
brew "mpdecimal" # required by google-cloud-sdk
brew "node"
brew "olets/tap/zsh-abbr"
brew "protobuf"
brew "ripgrep"
brew "shellcheck"
brew "sheldon"
brew "step"
brew "tenv"
brew "terminal-notifier"
brew "terraform-docs"
brew "tree"
brew "wget"
brew "xh"
brew "yazi"
brew "zola"
brew "zoxide"
brew "zsh"

cask "1password"
cask "1password-cli"
cask "antigravity"
cask "appcleaner"
cask "eul"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "imageoptim"
cask "karabiner-elements"
cask "manaflow-ai/cmux/cmux"
cask "qlmarkdown"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "wezterm@nightly"
cask "zoom"

if File.exist?("#{ENV['HOME']}/.Brewfile.local")
  instance_eval(File.read("#{ENV['HOME']}/.Brewfile.local"))
end
