tap "homebrew/bundle"
tap "aquaproj/aqua"
brew "actionlint"
brew "aquaproj/aqua/aqua"
brew "atuin"
brew "bat"
brew "curl"
brew "difftastic"
brew "duckdb"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "go"
brew "gojq"
brew "hugo"
brew "jnv"
brew "jq"
brew "kubectx"
brew "libpq"
brew "mise"
brew "mpdecimal" # required by google-cloud-sdk
brew "podman"
brew "readline" # required by google-cloud-sdk
brew "ripgrep"
brew "shellcheck"
brew "sheldon"
brew "sqlite" # required by google-cloud-sdk
brew "terraform-docs"
brew "wget"
brew "xh"
brew "zola"
brew "zoxide"
brew "zsh"
cask "appcleaner"
# cask "cursor"
cask "eul"
cask "google-cloud-sdk"
cask "imageoptim"
cask "podman-desktop"
cask "wezterm"

if File.exist?(".Brewfile.local")
  instance_eval(File.read(".Brewfile.local"))
end

vscode "arahata.linter-actionlint"
vscode "bbenoist.nix"
vscode "dhoeric.ansible-vault"
vscode "fnando.linter"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "lfs.vscode-emacs-friendly"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "naumovs.color-highlight"
vscode "nickgo.cuelang"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "sidneys1.gitconfig"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "zxh404.vscode-proto3"
