anthropic.claude-code@2.1.138
arahata.linter-actionlint@0.1.0
chrisdicarlo.vscode-switch-git-worktree@0.2.0
docker.docker@0.18.0
enkia.tokyo-night@1.1.2
fnando.linter@0.0.19
foxundermoon.shell-format@7.2.8
github.copilot-chat@0.45.1
github.vscode-github-actions@0.31.5
golang.go@0.52.2
hashicorp.hcl@0.6.0
hashicorp.terraform@2.39.2
lfs.vscode-emacs-friendly@0.9.0
ms-azuretools.vscode-containers@2.4.4
ms-azuretools.vscode-docker@2.0.0
ms-dotnettools.vscode-dotnet-runtime@3.0.0
ms-kubernetes-tools.vscode-kubernetes-tools@1.3.29
ms-mssql.data-workspace-vscode@0.6.3
ms-mssql.mssql@1.42.2
ms-mssql.sql-bindings-vscode@0.4.1
ms-mssql.sql-database-projects-vscode@1.5.9
ms-python.debugpy@2026.6.0
ms-python.isort@2026.4.0
ms-python.python@2026.4.0
ms-python.vscode-pylance@2026.2.1
ms-python.vscode-python-envs@1.30.0
ms-vscode-remote.remote-containers@0.459.0
ms-vscode-remote.remote-ssh@0.122.0
ms-vscode-remote.remote-ssh-edit@0.87.0
ms-vscode-remote.remote-wsl@0.104.3
ms-vscode-remote.vscode-remote-extensionpack@0.26.0
ms-vscode.cmake-tools@1.23.52
ms-vscode.cpp-devtools@0.5.13
ms-vscode.cpptools@1.32.2
ms-vscode.makefile-tools@0.12.17
ms-vscode.remote-explorer@0.5.0
ms-vscode.remote-server@1.5.3
naumovs.color-highlight@2.8.0
nickgo.cuelang@0.0.1
openai.chatgpt@26.506.31421
platformio.platformio-ide@3.3.4
redhat.vscode-commons@0.0.6
redhat.vscode-yaml@1.23.0
rust-lang.rust-analyzer@0.3.2887
saoudrizwan.claude-dev@3.82.0
shardulm94.trailing-spaces@0.4.1
sidneys1.gitconfig@2.0.1
tamasfe.even-better-toml@0.21.2
timonwong.shellcheck@0.39.5
vadimcn.vscode-lldb@1.11.4
vscode-icons-team.vscode-icons@12.18.0
